tsung/createAccount-edit-viewprofile-logout.xml
<!--This is a combination of GET and POST requests. However, the data in the GET request is limited-->
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers='15000'/>
  </clients>

  <!-- Server side setup -->
  <servers>
    <server host="localhost" port="80" type="tcp"></server>
  </servers>

  <load>
    <arrivalphase phase="1" duration="1" unit="minute">
      <users arrivalrate="10" unit="second"></users>
    </arrivalphase>
  </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"></option>

    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>

  <sessions>
    <session name="http-example" probability="100" type="ts_http">

      <for from="1" to="10" incr="1" var="counter">

        <!-- Sign up -->

        <request subst="true">
          <http url="/" method="GET" version="1.1" />
        </request>

        <request subst="true">
          <http url="/signup" method="GET" version="1.1" />
        </request>

        <request subst="true">
          <http url="/signup" method="POST" version="1.1" contents="user[name]=whereyouwannabe%%_counter%%&amp;user[age]=20&amp;user[city]=Santa Barbara&amp;
          user[email]=whereyouwannabe%%_counter%%@gmail.com&amp;user[password]=foobar&amp;user[password_confirmation]=foobar&amp;commit=Create User" 
          content_type="application/x-www-form-urlencoded" />
        </request>

        <!-- Edit account -->

        <request subst="true">
          <http url="/users/whereyouwannabe%%_counter%%/edit" method="GET" version="1.1" />
        </request>

        <request subst="true">
          <http url="/users/whereyouwannabe%%_counter%%/edit" method="POST" version="1.1" 
          contents="user[home_address]=San Clemente Villages&amp;user[age]=30&amp;commit=Update User" 
          content_type="application/x-www-form-urlencoded" />
        </request>
        
        <!-- Log out -->

        <request subst="true">
          <http url="/logout" method="POST" version="1.1" contents="_method=delete" content_type="application/x-www-form-urlencoded"/>
        </request>

        <!-- Log in with new email -->

        <request subst="true">
          <http url="/login" method="POST" version="1.1" contents="session[email]=whereyouwannabe%%_counter%%@gmail.com&amp;
          session[password]=foobar&amp;commit=Log in" content_type="application/x-www-form-urlencoded" />
        </request>
        
        <request subst="true">
          <http url="/users/whereyouwannabe%%_counter%%" method="GET" version="1.1" />
        </request>

        <!-- Log out -->

        <request subst="true">
          <http url="/logout" method="POST" version="1.1" contents="_method=delete" content_type="application/x-www-form-urlencoded"/>
        </request>

      </for>

    </session>
  </sessions>
</tsung>