tsung/createAccount-edit-viewprofile-logout.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers='15000'/>
  </clients>

  <!-- Server side setup -->
  <servers>
    <server host="wbwy-testanother.mui3yzewey.us-west-2.elasticbeanstalk.com" port="80" type="tcp"></server>
  </servers>

  <load>
    <arrivalphase phase="1" duration="1" unit="minute">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>
  </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"></option>

    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>

  <sessions>
    <session name="http-example" probability="100" type="ts_http">


        <!-- Sign up -->

        <request subst="true">
          <http url="/" method="GET" version="1.1" />
        </request>

        <request subst="true">
          <http url="/signup" method="GET" version="1.1" />
        </request>

        <request subst="true">
          <dyn_variable name="userid" re="Location: .*/users/([0-9]+)"></dyn_variable>
          <http url="/users" method="POST" version="1.1" contents="user[name]=Aprilcomesshewill&amp;user[age]=20&amp;user[city]=Santa Barbara&amp;
          user[email]=outoftune@gmail.com&amp;user[password]=foobar&amp;user[password_confirmation]=foobar&amp;user[home_address]=foobar&amp;commit=Create User"
          content_type="application/x-www-form-urlencoded" />
        </request>

        <!-- Edit account -->

        <request subst="true">
          <http url="/users/%%_userid%%/edit" method="GET" version="1.1" />
        </request>

        <request subst="true">
          <http url="/users/%%_userid%%" method="PATCH" version="1.1"
          contents="user[home_address]=San Clemente Villages&amp;user[age]=30&amp;commit=Update User"
          content_type="application/x-www-form-urlencoded" />
        </request>

        <!-- Log out -->

        <request subst="true">
          <http url="/logout" method="DELETE" version="1.1" content_type="application/x-www-form-urlencoded" />
        </request>


    </session>
  </sessions>
</tsung>