tsung/createsMultipleEvents.xml
<!--This is a POST request focused test where creates events, locations and tag-->
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers='30000'/>
  </clients>

  <!-- Server side setup -->
  <servers>
    <server host="wbwy-1.mui3yzewey.us-west-2.elasticbeanstalk.com" port="80" type="tcp"></server>
  </servers>


  <load>
    <arrivalphase phase="1" duration="1" unit="minute">
      <users arrivalrate="10" unit="second"></users>
    </arrivalphase>
  </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"></option>

    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>

  <sessions>
    <session name="http-example" probability="100" type="ts_http">
      
      <request subst="true">
        <http url="/login" method="POST" version="1.1" contents="session[email]=example@railstutorial.org&amp;session[password]=foobar&amp;commit=Login" content_type="application/x-www-form-urlencoded" />
      </request>
      
      <request subst="true">
        <http url="/events/new" method="GET" version="1.1" />
      </request>
  
      <request subst="true">
         <http url="/logout" method="POST" version="1.1" contents="_method=delete" content_type="application/x-www-form-urlencoded"/>
      </request>
        
    </session>
  </sessions>
</tsung>